vinhlephu-lpv/robot-ws/src/esp32_source/code0109/code0109.ino
float calculateMovingAverage(float buffer[], int size) {
  float sum = 0;
  for (int i = 0; i < size; i++) sum += buffer[i];
  return sum / size;
}

void calculateSpeed() {
  unsigned long now = millis();
  if (now - lastSpeedCalcTime < SPEED_CALC_INTERVAL_MS) return;
  float dt = (now - lastSpeedCalcTime) / 1000.0f;
  lastSpeedCalcTime = now;

  for (int i = 0; i < 4; i++) {
    noInterrupts();
    long curCount = enc[i].count;
    interrupts();

    long pulses = curCount - enc[i].lastSpeedCount;
    enc[i].lastSpeedCount = curCount;

    // 1. TẤM KHIÊN GIỚI HẠN VẬT LÝ TUYỆT ĐỐI (Physical Pulse Clamp lên tới 360 RPM):
    if (labs(pulses) > 60) {
      pulses = (pulses > 0) ? 60 : -60;
    }

    // 2. BỘ LỌC CHỐNG TRÔI ẢO KHI DỪNG (Deadband Zero-Motion Suppression):
    if (!isMoving && wpid[i].targetRPM <= 0.1f && labs(pulses) <= 1) {
      pulses = 0;
    }

    float rawRPM = (pulses * 60.0f) / (ENCODER_PPR * dt);

    // 3. BỘ LỌC ĐỘT BIẾN NHIỄU CỰC ĐẠI:
    if (fabsf(rawRPM) > MAX_PLAUSIBLE_RPM) {
      rawRPM = enc[i].prevFilteredRpm;
    }

    // 4. BỘ LỌC KALMAN 1D PHẢN ỨNG NHANH (Fast Responsive Kalman Filter - Độ trễ < 50ms):
    enc[i].rpm = updateKalman1D(kfRpm[i], rawRPM);
    enc[i].prevFilteredRpm = enc[i].rpm;

    enc[i].speed_ms   = enc[i].rpm * WHEEL_CIRCUMFERENCE / 60.0f;
    enc[i].distance_m += (labs(pulses) * WHEEL_CIRCUMFERENCE * distCalibScale) / ENCODER_PPR;
  }

#if WHEEL3_ENCODER_FAULT
  enc[3].rpm        = enc[2].rpm;
  enc[3].speed_ms   = enc[2].speed_ms;
  enc[3].distance_m = enc[2].distance_m;
  enc[3].count      = enc[2].count;
#endif

  // Gửi Odometry phản hồi lên ROS 2 qua Serial (20 Hz)
  float v_left  = (enc[0].speed_ms + enc[1].speed_ms) / 2.0f;
  float v_right = (enc[2].speed_ms + enc[3].speed_ms) / 2.0f;

  if (currentDirection == "BACKWARD") {
    v_left  = -fabsf(v_left);
    v_right = -fabsf(v_right);
  } else if (currentDirection == "LEFT") {
    v_left  = -fabsf(v_left);
    v_right = fabsf(v_right);
  } else if (currentDirection == "RIGHT") {
    v_left  = fabsf(v_left);
    v_right = -fabsf(v_right);
  } else if (currentDirection == "ROS") {
    v_left  = (rosTargetRpmSigned[0] < 0) ? -fabsf(v_left) : fabsf(v_left);
    v_right = (rosTargetRpmSigned[2] < 0) ? -fabsf(v_right) : fabsf(v_right);
  } else {
    if (slew[0].target < 0) v_left  = -fabsf(v_left);
    if (slew[2].target < 0) v_right = -fabsf(v_right);
  }

  if (!isMoving || (fabsf(enc[0].rpm) < 1.0f && fabsf(enc[1].rpm) < 1.0f)) v_left = 0.0f;
  if (!isMoving || (fabsf(enc[2].rpm) < 1.0f && fabsf(enc[3].rpm) < 1.0f)) v_right = 0.0f;

  // 1. Giao thức ODOM chuẩn ROS 2 (m/s)
  Serial.printf("ODOM %.3f %.3f\n", v_left, v_right);

  // 2. Giao thức ENC 4 bánh (ticks & dt_ms)
  unsigned int dt_ms = (unsigned int)(dt * 1000.0f + 0.5f);
  Serial.printf("ENC %ld %ld %ld %ld %u\n", enc[0].count, enc[1].count, enc[2].count, enc[3].count, dt_ms);

  // Điều khiển tự động chạy đúng quãng đường theo mét (Smooth Trapezoidal Distance Profile)
  if (isDistanceMode && isMoving) {
    float traveled0 = fabsf(enc[0].distance_m - startDistMeters[0]);
    float traveled1 = fabsf(enc[1].distance_m - startDistMeters[1]);
    float traveled2 = fabsf(enc[2].distance_m - startDistMeters[2]);
    float traveled3 = fabsf(enc[3].distance_m - startDistMeters[3]);
    float currentTraveled = (traveled0 + traveled1 + traveled2 + traveled3) / 4.0f;

    float remaining = targetDistMeters - currentTraveled;

    if (remaining <= 0.02f) { // Khi vừa chạm đích (còn dưới 2cm)
      currentDirection = "STOP";
      for (int i = 0; i < 4; i++) {
        wpid[i].targetRPM = 0.0f;
        slew[i].target = 0;
      }

      float maxRpm = 0.0f;
      for (int k = 0; k < 4; k++) {
        float r = fabsf(enc[k].rpm);
        if (r > maxRpm) maxRpm = r;
      }
      // Chỉ chốt khóa neo khi toàn bộ 4 bánh đã dừng hẳn
      if (maxRpm < 2.0f) {
        writeAllDrives(0, 0, 0, 0);
        isMoving = false;
        isDistanceMode = false;
        manualDriveActive = false;
        isPositionAnchorLocked = true;
        for (int i = 0; i < 4; i++) anchorTargetPulses[i] = enc[i].count;
        Serial.printf("\n[DIST] >>> DA TOI DICH! Dung chinh xac: %.3fm | KICH HOAT KHOA NEO TOA DO <<<\n\n", currentTraveled);
      }
    } else if (remaining < DECEL_DIST_THRESHOLD) {
      float ratio = constrain(remaining / DECEL_DIST_THRESHOLD, 0.0f, 1.0f);
      float decelRPM = 4.0f + (distCruiseRPM - 4.0f) * (ratio * ratio);
      decelRPM = constrain(decelRPM, 4.0f, distCruiseRPM);
      for (int i = 0; i < 4; i++) wpid[i].targetRPM = decelRPM;
    }
  }

  updateWheelHealth();
  updatePID(dt);
}

void updateWheelHealth() {
  if (!isMoving) {
    for (int i = 0; i < 4; i++) wHealth[i] = {false, false, false, 0, 0};
    return;
  }
  unsigned long now = millis();

  float totalRpm = 0.0f;
  for (int i = 0; i < 4; i++) totalRpm += fabsf(enc[i].rpm);
  float avgRpm = totalRpm / 4.0f;

  for (int i = 0; i < 4; i++) {
#if WHEEL3_ENCODER_FAULT
    if (i == 3) { wHealth[3] = wHealth[2]; continue; }
#endif
    float rpm = fabsf(enc[i].rpm);
    int   pwm = abs(slew[i].target);
    float tgt = wpid[i].targetRPM;

    // 1. Phát hiện kẹt cứng / hỏng encoder (Chống chattering rung giật cờ stall)
    if (wHealth[i].isStalled) {
      if (tgt <= 0.1f || rpm > STALL_RPM_THRESHOLD + 3.0f) {
        wHealth[i].isStalled = false;
        wHealth[i].stallStartTime = 0;
      }
    } else {
      if (pwm > STALL_PWM_THRESHOLD && rpm < STALL_RPM_THRESHOLD) {
        if (wHealth[i].stallStartTime == 0) wHealth[i].stallStartTime = now;
        if (now - wHealth[i].stallStartTime > STALL_DETECT_MS) {
          wHealth[i].isStalled = true;
          Serial.printf("[HEALTH] CANH BAO: Banh %d bi KHOA/HONG!\n", i + 1);
        }
      } else {
        wHealth[i].stallStartTime = 0;
      }
    }

    // 2. Phát hiện bánh bị hẫng: Chỉ áp dụng khi chạy chế độ tự hành quãng đường
    if (isDistanceMode && tgt > 0 && avgRpm > 0.1f && rpm > 1.4f * tgt && rpm > 1.5f * avgRpm) {
      if (wHealth[i].hangStartTime == 0) wHealth[i].hangStartTime = now;
      if (now - wHealth[i].hangStartTime > 400 && !wHealth[i].isHanging) {
        wHealth[i].isHanging = true;
        Serial.printf("[HEALTH] PHAT HIEN: Banh %d bi HANG mat tiep xuc dat!\n", i + 1);
      }
    } else {
      wHealth[i].hangStartTime = 0;
      wHealth[i].isHanging = false;
    }

    wHealth[i].isFaulty = (wHealth[i].isStalled || wHealth[i].isHanging);
  }
}

