vinhlephu-lpv/robot-ws/src/esp32_source/code0109/code0109.ino
  for (int i = 0; i < 4; i++) {
    Serial.printf("[W%d] RPM:%6.1f | Spd:%.3fm/s | Dist:%.3fm | PWM:%4d",
                  i + 1, enc[i].rpm, enc[i].speed_ms, enc[i].distance_m, slew[i].target);
    if (pidGlobalEnabled && wpid[i].enabled) {
      Serial.printf(" | PID_tgt:%.0f | PID_pwm:%d", wpid[i].targetRPM, wpid[i].pwmOutput);
    }
    if (wHealth[i].isStalled) Serial.print(" [KHOA/HONG]");
    else if (wHealth[i].isHanging) Serial.print(" [HANG/TRUOT]");
    Serial.println();
  }
}

// ============================================================
//  12. SETUP & WEBSERVER CỐT LÕI
// ============================================================
void setup() {
  lockAllDriverPins();

  Serial.begin(115200);
  Serial.setTimeout(10);

#if defined(RGB_LED_PIN)
  neopixelWrite(RGB_LED_PIN, 0, 0, 0);
#endif

  pwmSetup(DRV1_RPWM, CH_DRV1_F); pwmSetup(DRV1_LPWM, CH_DRV1_R);
  pwmSetup(DRV2_RPWM, CH_DRV2_F); pwmSetup(DRV2_LPWM, CH_DRV2_R);
  pwmSetup(DRV3_RPWM, CH_DRV3_F); pwmSetup(DRV3_LPWM, CH_DRV3_R);
  pwmSetup(DRV4_RPWM, CH_DRV4_F); pwmSetup(DRV4_LPWM, CH_DRV4_R);
  writeAllDrives(0, 0, 0, 0);

  void (*isrFn[4])() = {isr_enc0, isr_enc1, isr_enc2, isr_enc3};
  for (int i = 0; i < 4; i++) {
    pinMode(enc[i].pinA, INPUT_PULLUP);
    pinMode(enc[i].pinB, INPUT_PULLUP);
    attachInterrupt(digitalPinToInterrupt(enc[i].pinA), isrFn[i], RISING);
    wpid[i].enabled = true;
    wpid[i].targetRPM = globalTargetRPM;
  }

  Serial.println("\n=== XE TU HANH 4 BANH PID (ROBOT CONTROLLER) ===");
  Serial.printf("Encoder: %d PPR | Banh: %.0fmm | MIN_PWM: %d | 4-Wheel Torque Boost: ON\n",
                ENCODER_PPR, WHEEL_DIAMETER_M * 1000, MIN_PWM);

  WiFi.mode(WIFI_STA);
  WiFi.begin(ssid, password);
  Serial.printf("\nDang ket noi den WiFi '%s'...", ssid);
  int attempts = 0;
  while (WiFi.status() != WL_CONNECTED && attempts < 25) {
    writeAllDrives(0, 0, 0, 0);
    delay(500); 
    Serial.print("."); 
    attempts++;
  }
  Serial.println();
  Serial.println("=========================================");
  if (WiFi.status() == WL_CONNECTED) {
    Serial.println("  WIFI DA KET NOI THANH CONG!");
    Serial.print  ("  >> IP KET NOI APP: ");
    Serial.println(WiFi.localIP());
    Serial.println("  (Go chu 'IP' tren Serial de xem lai bat ky luc nao)");
  } else {
    Serial.println("  [CANH BAO] Khong the ket noi WiFi!");
    Serial.printf ("  Khong tim thay hoac sai mat khau mang: '%s'\n", ssid);
    Serial.println("  Vui long sua lai ssid/password o dong 71-72!");
  }
  Serial.println("=========================================\n");

  server.enableCORS(true);

  server.on("/ping", HTTP_GET, []() {
    server.send(200, "text/plain", "ESP32 4-Wheel PID - IP: " + WiFi.localIP().toString());
  });

  server.on("/control", []() {
    int spd = -1;
    if (server.hasArg("speed"))      spd = server.arg("speed").toInt();
    else if (server.hasArg("val"))   spd = server.arg("val").toInt();
    else if (server.hasArg("pwm"))   spd = server.arg("pwm").toInt();
    else if (server.hasArg("value")) spd = server.arg("value").toInt();

    if (spd >= 0) {
      setVehicleSpeed(spd);
    }

    String cmd = "";
    if (server.hasArg("cmd"))          cmd = server.arg("cmd");
    else if (server.hasArg("command")) cmd = server.arg("command");
    else if (server.hasArg("action"))  cmd = server.arg("action");
    else if (server.hasArg("dir"))     cmd = server.arg("dir");

    if (cmd.length() > 0) {
      handleCommand(cmd);
      server.send(200, "text/plain", "OK: " + cmd + " | Speed: " + String(currentSpeed));
      return;
    }

    if (spd >= 0) {
      server.send(200, "text/plain", "OK: Speed updated to " + String(currentSpeed));
      return;
    }

    server.send(400, "text/plain", "Missing cmd or speed");
  });

  server.on("/speed", []() {
    int spd = currentSpeed;
    if (server.hasArg("val"))        spd = server.arg("val").toInt();
    else if (server.hasArg("value")) spd = server.arg("value").toInt();
    else if (server.hasArg("speed")) spd = server.arg("speed").toInt();
    else if (server.hasArg("pwm"))   spd = server.arg("pwm").toInt();
    setVehicleSpeed(spd);
    server.send(200, "text/plain", "OK: Speed = " + String(currentSpeed));
  });

  server.on("/pwm", []() {
    int spd = currentSpeed;
    if (server.hasArg("val"))        spd = server.arg("val").toInt();
    else if (server.hasArg("pwm"))   spd = server.arg("pwm").toInt();
    else if (server.hasArg("value")) spd = server.arg("value").toInt();
    setVehicleSpeed(spd);
    server.send(200, "text/plain", "OK: PWM = " + String(currentSpeed));
  });

  server.on("/status", HTTP_GET, []() {
    String json = "{\"is_moving\":" + String(isMoving ? "true" : "false") + ",";
    json += "\"direction\":\"" + currentDirection + "\",";
    json += "\"speed\":" + String(currentSpeed) + ",";
    json += "\"pid_enabled\":" + String(pidGlobalEnabled ? "true" : "false") + ",";
    json += "\"rpm_left\":" + String((enc[0].rpm + enc[1].rpm) / 2.0f, 1) + ",";
    json += "\"rpm_right\":" + String((enc[2].rpm + enc[3].rpm) / 2.0f, 1) + "}";
    server.send(200, "application/json", json);
  });

  server.on("/encoders", HTTP_GET, []() {
    String json = "{";
    for (int i = 0; i < 4; i++) {
      json += "\"enc" + String(i + 1) + "\":{";
      json += "\"count\":"      + String(enc[i].count)        + ",";
      json += "\"rpm\":"        + String(enc[i].rpm,       1) + ",";
      json += "\"speed_ms\":"   + String(enc[i].speed_ms,  3) + ",";
      json += "\"distance_m\":" + String(enc[i].distance_m,3) + "}";
      if (i < 3) json += ",";
    }
    json += "}";
    server.send(200, "application/json", json);
  });

  server.on("/pid", []() {
    if (server.hasArg("enabled")) {
      String en = server.arg("enabled");
      pidGlobalEnabled = (en == "1" || en == "true");
      for (int i = 0; i < 4; i++) {
        wpid[i].enabled = pidGlobalEnabled;
        wpid[i].integral = 0; wpid[i].lastError = 0;
        wpid[i].pwmOutput = currentSpeed; wpid[i].prevPwmOutput = currentSpeed;
      }
    }
    if (server.hasArg("target_rpm")) {
      globalTargetRPM = server.arg("target_rpm").toFloat();
      for (int i = 0; i < 4; i++) wpid[i].targetRPM = globalTargetRPM;
    }
    server.send(200, "application/json", "{\"pid_enabled\":" + String(pidGlobalEnabled ? "true" : "false") + ",\"target_rpm\":" + String(globalTargetRPM, 1) + "}");
  });

  server.begin();
  Serial.println("Web Server da san sang!");
}

// ============================================================
//  13. VÒNG LẶP CHÍNH (LOOP)
// ============================================================
void loop() {
  server.handleClient();

  // Đọc Serial non-blocking không làm trễ chu kỳ điều khiển động cơ
  while (Serial.available() > 0) {
    char c = (char)Serial.read();
    if (c == '\n' || c == '\r') {
      if (serialRxBuf.length() > 0) {
        handleCommand(serialRxBuf);
        serialRxBuf = "";
      }
    } else {
      if (serialRxBuf.length() < 64) serialRxBuf += c;
    }
  }

  updateSpeedRamp();

  if (currentDirection == "STOP" && isMoving) {
    bool allStopped = true;
    for (int i = 0; i < 4; i++) {
      if (fabsf(slew[i].current) > 2.0f || fabsf(enc[i].rpm) > 1.5f) {
        allStopped = false;
        break;
      }
    }
    if (allStopped) {
      writeAllDrives(0, 0, 0, 0);
      isMoving = false;
    }
  }

  // An toàn ROS Watchdog (600ms không có lệnh từ Pi -> Tự động dừng xe an toàn)
  if (currentDirection == "ROS" && isMoving) {
    if (millis() - lastRosCmdTime > ROS_WATCHDOG_TIMEOUT_MS) {
      stopMotor(false);
      Serial.println("# [WATCHDOG] Pi mat ket noi qua 600ms -> Tu dong ngat xe an toan!");
    }
  }

  if (manualDriveActive && currentDirection != "STOP" && currentDirection != "ROS" && !pidGlobalEnabled) {
    writeSpeed(currentSpeed);
  }

  calculateSpeed();
  printDebugInfo();

  delay(1);
}
